/**
 * 7.1.2 定义改进的Sales_data类
 * @Author Bob
 * @Eamil 0haizhu0@gmail.com
 * @Date 2017/8/16
 */
int main(){
  /**
   * 成员函数：声明必须在类的内部，定义可以在内部也可以再外部。
   * 普通函数：作为接口组成部分的非成员函数，他们的声明和定义都在类的外部。
   */

  /**
   * 引入this：和Java一样，表示当前对象，注意，this是一个指针，访问当前对象属性时使用 this->
   */

  /**
   * 引入const成员函数：紧跟参数列表之后的const关键字，作用是修改隐式this的指针类型。
   *
   * 参考：Sales_data 中的 isbn 成员函数
   */

  /**
   * 类作用域和成员函数：编译器首先编译成员的声明，然后才编译成员函数的声明（如果有的话）。
   */

  /**
   * 在类的外部定义成员函数
   */

  /**
   * 定义一个返回this对象的函数：return *this;
   */
  return 0;
}
